## Date and Time Built-in Functions

#### List of functions:

YEAR(), MONTH(), WEEK(), DAY(), DAYOFYEAR(), DAYOFMONTH(), DAYOFWEEK(), HOUR(), MINUTE(), SECOND()

In [1]:
%load_ext sql
%sql ibm_db_sa://mpc82210:7rf3d7vvlfj%5Egf7d@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB

In [2]:
%sql SELECT * FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(1, 'Cat', 9, Decimal('450.09'), datetime.date(2018, 5, 29)),
 (2, 'Dog', 3, Decimal('666.66'), datetime.date(2018, 6, 1)),
 (3, 'Dog', 1, Decimal('100.00'), datetime.date(2018, 6, 4)),
 (4, 'Parrot', 2, Decimal('50.00'), datetime.date(2018, 6, 4)),
 (5, 'Dog', 1, Decimal('75.75'), datetime.date(2018, 6, 10)),
 (6, 'Hamster', 6, Decimal('60.60'), datetime.date(2018, 6, 11)),
 (7, 'Cat', 1, Decimal('44.44'), datetime.date(2018, 6, 11)),
 (8, 'Goldfish', 24, Decimal('48.48'), datetime.date(2018, 6, 14)),
 (9, 'Dog', 2, Decimal('222.22'), datetime.date(2018, 6, 15))]

#### DAY()

In [5]:
%sql SELECT ANIMAL, DAY(RESCUEDATE) AS DAY_OF_RESCUE FROM PETRESCUE WHERE ANIMAL='Cat'

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('Cat', 29), ('Cat', 11)]

In [6]:
%sql SELECT * FROM PETRESCUE WHERE DAY(RESCUEDATE) BETWEEN 14 AND 29

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(1, 'Cat', 9, Decimal('450.09'), datetime.date(2018, 5, 29)),
 (8, 'Goldfish', 24, Decimal('48.48'), datetime.date(2018, 6, 14)),
 (9, 'Dog', 2, Decimal('222.22'), datetime.date(2018, 6, 15))]

In [9]:
%sql SELECT * FROM PETRESCUE WHERE DAY(RESCUEDATE) BETWEEN 14-5 AND 14+5

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(5, 'Dog', 1, Decimal('75.75'), datetime.date(2018, 6, 10)),
 (6, 'Hamster', 6, Decimal('60.60'), datetime.date(2018, 6, 11)),
 (7, 'Cat', 1, Decimal('44.44'), datetime.date(2018, 6, 11)),
 (8, 'Goldfish', 24, Decimal('48.48'), datetime.date(2018, 6, 14)),
 (9, 'Dog', 2, Decimal('222.22'), datetime.date(2018, 6, 15))]

#### OPERATION WITH DATE (n DAYS)

In [12]:
%sql SELECT (RESCUEDATE+3 DAYS) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(datetime.date(2018, 6, 1),),
 (datetime.date(2018, 6, 4),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 13),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 17),),
 (datetime.date(2018, 6, 18),)]

#### Special Registers: CURRENT_DATE, CURRENT_TIME

In [14]:
%sql SELECT (CURRENT_DATE - RESCUEDATE) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('20521'),),
 (Decimal('20518'),),
 (Decimal('20515'),),
 (Decimal('20515'),),
 (Decimal('20509'),),
 (Decimal('20508'),),
 (Decimal('20508'),),
 (Decimal('20505'),),
 (Decimal('20504'),)]